#include <stdio.h>

//Написать инструкцию вывода значений целых переменных а, b и с. Значение каждой
//переменной должно быть выведено в отдельной строке


int main(){
    //Инициализация переменных
    int a = 10;
    int b = 20;
    int c = 30;


    //Вывод
    printf("%d\n", a);
    printf("%d\n", b);
    printf("%d\n", c);

    
    return 0;
}