#include <stdio.h>

//Написать программу, которая выводит на экран ваши имя и фамилию.
int main(){
    printf("Nikonov Andrey\n");
    return 0;
}