#include <stdio.h>

//Написать программу, которая выводит на экран путь к файлу stdio.h

int main(){
    printf("C:\\MinGW\\include\\stdio.h"); 
    return 0;
}